(function () {
  window["W"] = {
    readAsText: function (path, f) {
      var reader = new FileReader();
      reader.readAsText(path[0]);
      reader.onload = function (data, filename) {
        console.log("W: 文件-" + path[0].name + "-读取成功");
        f(data.target.result, path[0].name);
      };
    },
    getMajor: function () {
      return [
        "19电子科学与技术班",
        "19电子信息工程班",
        "19广播电视工程(中广班)",
        "19广播电视工程1班",
        "19广播电视工程2班",
        "19广播电视工程3班",
        "19软件工程1班",
        "19软件工程2班",
        "19数字媒体技术1班",
        "19数字媒体技术2班",
        "19数字媒体技术3班",
        "19通信工程班",
        "19网络工程1班",
        "19网络工程2班",
      ];
    },
    getProvince: function () {
      return [
        "河北省",
        "山西省",
        "辽宁省",
        "吉林省",
        "黑龙江省",
        "江苏省",
        "浙江省",
        "安徽省",
        "福建省",
        "江西省",
        "山东省",
        "河南省",
        "湖北省",
        "湖南省",
        "广东省",
        "海南省",
        "四川省",
        "贵州省",
        "云南省",
        "陕西省",
        "甘肃省",
        "青海省",
        "台湾省",
        "内蒙古自治区",
        "广西壮族自治区",
        "西藏自治区",
        "宁夏回族自治区",
        "新疆维吾尔自治区",
        "北京市",
        "天津市",
        "上海市",
        "重庆市",
        "香港特别行政区",
        "澳门特别行政区",
      ];
    },
  };
})();
